In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [2]:
df={'Col_1':[3,6,8,2,4,5],'Col_2':['Bibek','Bibek','Binaya','B','C3','D4']}

In [3]:
data=pd.DataFrame(df)

In [4]:
data

   Col_1   Col_2
0      3   Bibek
1      6   Bibek
2      8  Binaya
3      2       B
4      4      C3
5      5      D4

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col_1   6 non-null      int64
 1   Col_2   6 non-null      object
dtypes: int64(1), object(1)
memory usage: 224.0+ bytes

In [6]:
data

   Col_1   Col_2
0      3   Bibek
1      6   Bibek
2      8  Binaya
3      2       B
4      4      C3
5      5      D4

In [7]:
data.Col_2.str.contains('[0-9][0-9]|[0-9]',regex=True)

0    False
1    False
2    False
3    False
4     True
5     True
Name: Col_2, dtype: bool

In [8]:
def Floor_Type(x):
    return x.split(' ')[0]

Floor_Type("混合结构")

'混合结构'

In [9]:
def Floor_Height(y):
    try:
        return int(y.split(' ')[1])
    except:
        return np.nan

In [10]:
Floor_Height("高 26")

26

In [12]:
data['Col_3']=np.nan

In [13]:
data

   Col_1   Col_2  Col_3
0      3   Bibek    NaN
1      6   Bibek    NaN
2      8  Binaya    NaN
3      2       B    NaN
4      4      C3    NaN
5      5      D4    NaN

In [17]:
df0=data[['Col_1','Col_2']]
df0

   Col_1   Col_2
0      3   Bibek
1      6   Bibek
2      8  Binaya
3      2       B
4      4      C3
5      5      D4

In [8]:
x=5
a=f"my number is {x}"
print(a)

In [9]:
mains()

'my number is 5'